docs/projects/mtech.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>M.Tech Projects</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../style.css" />
</head>
<body>
<div id="preamble" class="status">
<ul class="sidebar" id="mySideNav">
  <a id="menu" href="javascript:void(0);" class="icon" onclick="myFunction()"><b>MENU</b></a>
  <a id="home" href="/index.html">Home</a>
  <a id="research" href="/research-topics/index.html">Research</a>
  <a id="publications" href="/publications.html">Publications</a>
  <a id="blogs" href="/blogs/index.html">Blogs</a>
  <a id="projects" href="/projects/index.html">Projects</a>
  <a id="bio" href="/bio.html">Bio</a>
  </ul>
<script>
function myFunction() {
  var x = document.getElementById("mySideNav");
  if (x.className === "sidebar") {
    x.className += " responsive";
  } else {
    x.className = "sidebar";
  }
}
</script> 
</div>
<div id="content" class="content">
<div class="logo">
<a class="logo__link" title="Kanishak Vaidya" rel="home">
<div class="logo__item logo__text">
<div class="logo__title">Kanishak Vaidya</div>
<div class="logo__tagline">Senior Engineer | Qualcomm Bangalore.</div>
</div></a>
<!-- div style="float:right;">
  <div class="toggle-light light" ></div >
</div-->
</div>
<script> document.querySelectorAll("#mySideNav a#projects")[0].classList.add("active"); </script>

<div id="outline-container-org2b5945e" class="outline-2">
<h2 id="org2b5945e">Communications Projects</h2>
<div class="outline-text-2" id="text-org2b5945e">
</div>
<div id="outline-container-orgd02cde8" class="outline-3">
<h3 id="orgd02cde8">OFDM</h3>
<div class="outline-text-3" id="text-orgd02cde8">
<ul class="org-ul">
<li>M.Tech 1st Semester</li>
<li>Software used: MATLAB and Simulink</li>
</ul>
<p>
Implemented an OFDM system on Simulink. Performed simulation and analysis of OFDM system based on simulink.
</p>
</div>
</div>
<div id="outline-container-org5d7ae1d" class="outline-3">
<h3 id="org5d7ae1d">Finite field arithmetic</h3>
<div class="outline-text-3" id="text-org5d7ae1d">
<ul class="org-ul">
<li>PhD 2nd year</li>
<li>Implemented on Python</li>
</ul>
<p>
Wrote python modules for finite field arithmetic. Some linear algebra operations and Reed solomon decoder was also implemented for finite fields with prime order.
</p>
</div>
</div>
</div>

<div id="outline-container-org52724d2" class="outline-2">
<h2 id="org52724d2">Computer Vision and Image Processing Projects</h2>
<div class="outline-text-2" id="text-org52724d2">
</div>
<div id="outline-container-org3efe930" class="outline-3">
<h3 id="org3efe930">Image Segmentation using Watershed Transform</h3>
<div class="outline-text-3" id="text-org3efe930">
<ul class="org-ul">
<li>M.Tech 1st Semester</li>
<li>Team Size: 2</li>
<li>Software Used: MATLAB and Python</li>
</ul>
<p>
Implemented immersion simulations on grayscale images to segment different regions by using watershed transform.
</p>
</div>
</div>

<div id="outline-container-org281c0a5" class="outline-3">
<h3 id="org281c0a5">Image mosaic using homography estimation</h3>
<div class="outline-text-3" id="text-org281c0a5">
<ul class="org-ul">
<li>M.Tech 2nd Semester</li>
<li>Software used: MATLAB</li>
</ul>
<p>
Stiched five images taken of a subject from five different viewpoints to create a mosaic. Implemented SIFT matching from <code>vlfeat.org</code> and used homography estimation using normalization of scales to morph images to stich them in a mosaic.
</p>
</div>
</div>

<div id="outline-container-orgaa7c5bf" class="outline-3">
<h3 id="orgaa7c5bf">Finding rotation and translation direction using two images</h3>
<div class="outline-text-3" id="text-orgaa7c5bf">
<ul class="org-ul">
<li>M.Tech 2nd Semester</li>
<li>Software used: MATLAB</li>
</ul>
<p>
Computed the rotation and translation direction between two images using the Hartley normalization for the eight point algorithm. Matching points were computed using SIFT and outliers removed using RANSAC.
</p>
</div>
</div>
</div>
</div>
</body>
</html>
